<!-- add-pr-comment:add-pr-comment -->

##  SetupOIDC TF plan on feature branch (Triggered by Mtekdevops)
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_openid_connect_provider.GithubOidc[0] will be created
  + resource "aws_iam_openid_connect_provider" "GithubOidc" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.OIDCRole will be created
  + resource "aws_iam_role" "OIDCRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubOIDCRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AdminAccess will be created
  + resource "aws_iam_role_policy_attachment" "AdminAccess" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "GitHubOIDCRole"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + OIDCRole = (known after apply)

```